emacs/.emacs.d/libs/zettelkasten.el
(add-hook 'after-init-hook 'org-roam-setup)
(setq org-roam-v2-ack t)

(use-package org-roam
  :config
  (setq org-roam-directory "~/org_roam/"
	org-roam-dailies-directory "~/org_roam/daily")

  (cl-defmethod org-roam-node-directories ((node org-roam-node))
    "Access slot \"directory\" of org-roam-node struct CL-X"
    (if-let ((dirs (file-name-directory (file-relative-name (org-roam-node-file node) org-roam-directory))))
	(format "(%s)" (car (f-split dirs)))
      ""))

  (cl-defmethod org-roam-node-backlinkscount ((node org-roam-node))
    "Access slot \"backlinks\" of org-roam-node struct CL-X"
    (let* ((count (caar (org-roam-db-query
			 [:select (funcall count source)
				  :from links
				  :where (= dest $s1)
				  :and (= type "id")]
			 (org-roam-node-id node)))))
      (format "[%d]" count)))

  (cl-defmethod org-roam-node-backlinkscount-number ((node org-roam-node))
    "Access slot \"backlinks\" of org-roam-node struct CL-X. This
    is identical to `org-roam-node-backlinkscount' with the
    difference that it returns a number instead of a formatted
    string. This is to be used in
    `org-roam-node-sort-by-backlinks'"
    (let* ((count (caar (org-roam-db-query
			 [:select (funcall count source)
				  :from links
				  :where (= dest $s1)
				  :and (= type "id")]
			 (org-roam-node-id node)))))
      count))

  (cl-defmethod org-roam-node-todostate ((node org-roam-node))
    "Modified version of org-roam-node-todo to look a bit better"
    (if-let ((state (org-roam-node-todo node)))
	(format "Status: %s" state)))

  (cl-defmethod org-roam-node-buffer ((node org-roam-node))
    "Access slot \"buffer\" of org-roam-node struct CL-X"
    (let ((buffer (get-file-buffer (org-roam-node-file node))))
      buffer))

  (setq org-roam-node-display-template "${title:115} ${backlinkscount:6} ${todostate:20} ${directories:10} ${tags:15}")

  (add-to-list 'display-buffer-alist
	       '("\\*org-roam\\*"
		 (display-buffer-in-direction)
		 (direction . right)
		 (window-width . 0.40)
		 (window-height . fit-window-to-buffer))))

(defun org-roam-buffer-without-latex ()
    "Essentially `org-roam-buffer-toggle' but it ensures latex previews are turned off before toggling the buffer.

  This is useful because especially with index files, having
  latex previews on, makes opening the buffer very slow as it
  needs to load previews of many files. If you by default have
  `org-startup-with-latex-preview' set to t, you have probably
  noticed this issue before. This function solves it."
    (interactive)
    (let ((org-startup-with-latex-preview nil))
      (org-roam-buffer-toggle)))

(defun org-roam-permanent-note-p (NODE)
  "Check if NODE is at the top level org_roam directory using the
  `org-roam-node-directories' function. If it isn't,
  `org-roam-node-directories' will return a non empty string,
  therefore this expression will evaluate to nil. The way my
  notes are sorted, when a note is placed on the top level its a
  permanent note, while fleeting and reference notes are placed
  in subdirectories.

Therefore, this predicate function allows me to create a version
of `org-roam-node-find' which only shows my permanent notes,
which can be useful in some cases. That filtered function is
`org-roam-find-permanent-node'."
  (string-equal (org-roam-node-directories NODE) ""))

(defun org-roam-node-poi-or-moc-p (NODE)
  "Check if NODE has the tag POI or the tag MOC. Return t if it does"
  (or (string-equal (car (org-roam-node-tags NODE)) "POI")
      (string-equal (car (org-roam-node-tags NODE)) "MOC")))

(defun org-roam-find-permanent-node ()
  "Execute `org-roam-node-find' with the list being filtered to
only include permanent notes. In my system that is synonymous to
saying include only notes at the top level directory. The
filtering is done with the `org-roam-permanent-note-p' predicate
function."
  (interactive)
  (org-roam-node-find nil nil #'org-roam-permanent-note-p))

(setq bibtex-completion-bibliography
      '("~/org_roam/My_Library.bib" "~/org_roam/My_Library2.bib")
      bibtex-completion-pdf-field "File"
      bibtex-completion-library-path '("~/Sync/Zotero_pdfs"))

(setq bibtex-completion-additional-search-fields '(keywords abstract))

(setq ivy-bibtex-default-action 'ivy-bibtex-edit-notes)
(ivy-add-actions
 'ivy-bibtex
 '(("p" ivy-bibtex-open-any "Open pdf, url or DOI")))

(setq bibtex-completion-format-citation-functions
      '((org-mode . bibtex-completion-format-citation-org-title-link-to-PDF)
	(latex-mode . bibtex-completion-format-citation-cite)
	(markdown-mode . bibtex-completion-format-citation-pandoc-citeproc)
	(python-mode . bibtex-completion-format-citation-sphinxcontrib-bibtex)
	(rst-mode . bibtex-completion-format-citation-sphinxcontrib-bibtex)
	(default . bibtex-completion-format-citation-default)))

(require 'oc)
(require 'oc-csl)
(setq org-cite-global-bibliography '("~/org_roam/My_Library.bib" "~/org_roam/My_Library2.bib"))

(setq org-cite-export-processors '((t csl)))

(setq org-cite-csl-styles-dir "~/Zotero/styles")
(setq citeproc-org-default-style-file "~/Zotero/styles/american-chemical-society.csl")

(setq zotra-backend 'zotra-server
      zotra-local-server-directory "~/Cloned_Repositories/zotra-server/"
      zotra-default-bibliography "~/org_roam/My_Library2.bib"
      zotra-download-attachment-default-directory "~/Sync/Zotero_pdfs")
