emacs/.emacs.d/libs/zettelkasten.org
** Citar
The bibliography backend I currently use is ivy-bibtex (hence the above config). However, I have experimented with Citar for porting my package ~zetteldesk-ref~ to use it as a backend besides ivy-bibtex and honestly its a pretty neat package. I am considering moving to it as its a very nice and definitely super active project. This section holds my basic configurations for it which are for now at least only defining the paths to the bibliography and notes.

#+BEGIN_SRC elisp :tangle yes

  (setq citar-bibliography '("~/org_roam/My_Library.bib" "~/org_roam/My_Library2.bib"))
  (setq citar-notes-paths '("~/org_roam/ref"))

#+END_SRC
  
** Ebib
Ebib is an emacs bibliography manager program. My customisations for it live here. The 2 functions at the end of the block are taken directly from the info page and are used to view entries that were created recently. However, a minor change is made as ~ebib--newer-than~ compares the "timestamp" entry, while my files only have the "urldate" entry for this purpose.

#+BEGIN_SRC elisp :tangle yes
  (setq ebib-preload-bib-files '("~/org_roam/My_Library.bib" "~/org_roam/My_Library2.bib"))
  (setq ebib-notes-directory "~/org_roam/ref")
  (setq ebib-multiline-major-mode 'org-mode)

  (add-hook 'ebib-entry-mode-hook 'visual-line-mode)

  (setq ebib-index-columns '(("Title" 60 t)
  			     ("Author/Editor" 40 t)
  			     ("Year" 6 t)
  			     ("Entry Key" 40 t)
  			     ("Note" 10 t)))

  (require 'org-ebib)

  (setq ebib-citation-description-function 'ebib-create-org-title)

  (defun ebib-list-recent (days)
    "List entries created in the last DAYS days."
    (interactive "nNumber of days: ")
    ;; Save the database's current filter, if there is one.
    (let ((filter (ebib-db-get-filter ebib--cur-db)))
      (when filter (setq ebib--filters-last-filter filter)))
    (let*
  	;; Calculate the from-date in Emacs' time format.
  	((date (time-subtract (current-time) (days-to-time days)))
  	 ;; Create a Lisp expression that will function as the filter.
  	 (filter `(ebib--newer-than (quote ,date))))
      ;; Install it as the current database's filter.
      (ebib-db-set-filter filter ebib--cur-db)
      ;; Update the current entry key.
      (ebib-db-set-current-entry-key (ebib--get-key-at-point) ebib--cur-db)
      ;; Update the display, so that only filtered entries are visible.
      (ebib--update-buffers)))

  (defun ebib--newer-than (date)
    "Function for use in filters.
  Return t if the entry being tested is newer than DATE.  DATE must
  be a list of the format returned by `current-time' and is
  compared to the timestamp of the entry being tested.  If the
  entry has no timestamp, or a timestamp that cannot be converted
  into a date representation, return nil."
    (let ((timestamp (cdr (assoc-string "urldate" ebib-entry))))
      (when (and timestamp
  	       (setq timestamp (ignore-errors (date-to-time timestamp))))
        (time-less-p date timestamp))))

#+END_SRC

I have also written some minor extensions for ebib, shown in this code block. They revolve around filtering org-roam functions by entries currently marked in ebib, which I personally find useful. These rely on org-roam, zetteldesk.el, my extension to org-roam for richer filtering capabilities and my custom function ~org-roam-backlinks-roam-node-read*~ which runs ~org-roam-node-read~ with a custom node list. I already use that functionality from that section of my org-roam config and I didn't want to redefine in this section with a different name, to avoid unnecessary complexity.

#+BEGIN_SRC elisp :tangle yes

  (defun org-roam-ebib-collect-marked-nodes ()
    "Collect the `org-roam-node's of all references marked in ebib.

  This function collects the citekeys of all entries that have been marked
  in ebib, a value stored in the function `ebib-db-list-marked-entries'
  and finds the `org-roam-node's related to them. As this list will be
  populated with `nil' values for any marked entry that is not related to
  an `org-roam-node' make sure to remove all `nil' values before returning
  the list. This is important if this list is to be used in other
  functions, such as `org-roam-ebib-nodes-find'."
    (cl-loop for ref in (ebib-db-list-marked-entries ebib--cur-db)
  	   collect (org-roam-node-from-ref (concat "cite:" ref)) into nodes
  	   finally return (cl-remove-if nil nodes)))

  (defun org-roam-ebib-nodes-find ()
    "Run `org-roam-node-find' for nodes marked in ebib.

  This function uses `org-roam-ebib-collect-marked-nodes' to find a list
  of `org-roam-node's that have been marked in ebib and then essentially
  runs `org-roam-node-find' for them. However, it is implemented via the
  custom function `org-roam-backlinks-roam-node-read*' from my config,
  which accepts a custom list of nodes."
    (interactive)
    (find-file (org-roam-node-file (org-roam-backlinks-roam-node-read* (org-roam-ebib-collect-marked-nodes)))))

  (defun zetteldesk-add-ebib-marked-nodes ()
    "Add nodes marked in ebib to the `zetteldesk-desktop'.

  This function collects a list of `org-roam-node's via
  `org-roam-ebib-collect-marked-nodes' and adds them to the
  `zetteldesk-desktop' using `zetteldesk-add-node-to-desktop'."
    (cl-loop for node in (org-roam-ebib-collect-marked-nodes)
  	   do (zetteldesk-add-node-to-desktop node)))

#+END_SRC

* Org Roam Bibtex, Protocols (Reference notes) and UI (graphing capabilities)
   I require a bunch of packages so ORB, org roam ui and the roam protocols work as intended. I also make orb use ivy for completions.

   For a brief description of each ones use case, org-roam-bibtex (aka ORB) is an excellent package for bibliography management inside org-roam. Since other packages help out with this, the big thing this one does is that it hooks bibtex-completion to use the org-roam ecosystem for its notes. Org-protocol is for capturing info from a web page and adding it to an org file. The org-roam-protocol is basically integrating that to the org-roam ecosystem. Org-roam-ui is the new graphing package designed for org-roam-v2. We used to use org-roam-server for this, but with the migration to v2, this package was created (which is honestly better than org-roam-server) for an excellent visual graph of your org roam directory. There are many advantages to viewing your knowledge repository with a graph so this is a must have package. 

#+BEGIN_SRC elisp :tangle yes

  (require 'org-roam-bibtex)
  (org-roam-bibtex-mode 1)

  (setq orb-insert-interface 'ivy-bibtex
	orb-note-actions-interface 'ivy)
  (setq orb-preformat-keywords '("citekey" "author" "date" "entry-type" "keywords" "url" "file"))

  (require 'org-protocol)
  (require 'org-roam-protocol)

  (require 'websocket)
  (require 'org-roam-ui)

#+END_SRC

* Export a bibtex entry to org-roam
After a discussion in the M-x research group, the idea of a way to export a bibtex entry to an org-roam file was suggested. The idea is simple. Take a bibtex entry that has the typical fields but also some fields like related papers and annotations (essentially notes on the paper) and make it into an org-roam file to leverage the database capabilities of org-roam.

It is not of need for me as I initialize literature nodes with my own template (which can be found later in this file in my templates), but I understand the value of it for someone who wants to move to org-roam and already has a large amount of bibtex entries they wish to export.

Org-roam-bibtex allows for template pre-expanding, meaning a template that expands with information taken from the bibtex file. First, we need to set the preformat keywords to include everything we may be interested in. Then, create a template that automatically finishes and inserts all the information we want. Lastly, create an interactive function that prompts for a bibtex entry and initializes a note for it with our predefined template.
 
#+BEGIN_SRC elisp

  (setq orb-preformat-keywords '("citekey" "author" "date" "entry-type" "keywords" "url" "file" "journaltitle" "note" "annote"))

  (setq bibtex-export-capture-template
	'(("b" "bibliographic entry" plain "%?" :if-new
	   (file+head "ref/${citekey}.org" "#+title: ${title}\n
  - keywords :: ${keywords}
  - tags :: ${note}

  ,* ${entry-type} by ${author} in ${journaltitle}, ${date}\n
  ${annote}")
	   :unnarowed t
	   :jump-to-captured t
	   :immediate-finish t)))

  (defun bibtex-export-org-roam (citekey)
    "Export a bibtex entry to an org-roam file.

  If called interactively, select a citekey using
  `citar-select-ref'.  Otherwise, give a citekey and with that, set
  `org-roam-capture-templates' to `bibtex-export-capture-template',
  a template specifically for this purpose and run `orb--new-note'
  on that citekey using that template."
    (interactive (list (citar-select-ref)))
    (let ((org-roam-capture-templates bibtex-export-capture-template))
      (orb--new-note citekey)))

#+END_SRC

Another potential step in this system is to create methods specializing on the org-roam-node object which get the various fields of the bibtex file. This can be done fairly easily as the snippet
#+BEGIN_SRC elisp
(bibtex-completion-get-entry (car (org-roam-node-refs (org-roam-node-at-point))))
#+END_SRC
gets an alist of all the bibtex entries. (org-roam-node-at-point is used here for simplicity of testing, in a method this would be the NODE argument). From that alist, each method could extract a different field with ~assoc~. Once we have these, we can more easily manipulate the system to display more info about each bibtex entry in an org-roam-node-find type function. It could also be used for finding similar papers (two nodes which have at least one same keyword), filter by author, year or journal and many other things.

Things to capture:
The key is already stored in ~org-roam-node-refs~. Title is the file title in any sensible template. Author, year, journal, keywords are definitely worth saving. File, url, doi etc. can be found very easily and I don't think they are worth re-saving as node metadata, as the primary goal of this is to filter based on these and display them in an org-roam-display-template and neither of those would be used there.

Abstract and the annote field used for notes can be grabbed, although probably not going to be used. And the note field with related papers could be taken, but processing it is a bit hard probably.

#+BEGIN_SRC elisp

  (cl-defmethod org-roam-node-author ((node org-roam-node))
    "Access slot \"author\" of org-roam-node struct CL-X"
    (if-let ((ref (org-roam-node-refs node))
	     (key (string-remove-prefix "cite:" (car ref)))
	     (entry (bibtex-completion-get-entry key))
	     (author (cdr (assoc "author" entry))))
	author
      ""))

  (cl-defmethod org-roam-node-journal ((node org-roam-node))
    "Access slot \"journal\" of org-roam-node struct CL-X"
    (if-let ((ref (org-roam-node-refs node))
	     (key (string-remove-prefix "cite:" (car ref)))
	     (entry (bibtex-completion-get-entry key))
	     (journal (cdr (assoc "journal" entry))))
	journal
      ""))

  (cl-defmethod org-roam-node-keywords ((node org-roam-node))
    "Access slot \"keywords\" of org-roam-node struct CL-X"
    (if-let ((ref (org-roam-node-refs node))
	     (key (string-remove-prefix "cite:" (car ref)))
	     (entry (bibtex-completion-get-entry key))
	     (keywords (cdr (assoc "keywords" entry))))
	keywords
      ""))

  (cl-defmethod org-roam-node-year ((node org-roam-node))
    "Access slot \"year\" of org-roam-node struct CL-X"
    (if-let ((ref (org-roam-node-refs node))
	     (key (string-remove-prefix "cite:" (car ref)))
	     (entry (bibtex-completion-get-entry key))
	     (year (cdr (assoc "year" entry))))
	year
      ""))

#+END_SRC

