emacs/.emacs.d/libs/zettelkasten.el

(defvar-local org-roam-backlinks-files nil
  "Buffer local variable displaying a list of the absolute paths
  of all the files that are backlinked to current node. These are
  not added by default, and as such this variable has the value
  nil but they can be added by running the
  `org-roam-backlinks-find-files' function on a node.")

(defvar org-roam-backlinks-pdfs nil
  "After running `org-roam-export-backlinks-to-latex-pdf', to
  export a node and all its backlinks to pdf, the value of this
  variable in the original node's buffer will become a list of
  all the pdfs that were created. This is to ease the process of
  combining them as the value of this variable can then be passed
  to a program such as pdftk to combine them.")

(defun org-roam-backlinks-sort-by-backlinks (completion-a completion-b)
  "Sorting function for org-roam that sorts the list of nodes by
the number of backlinks. This is the sorting function in
`org-roam-backlinks-node-find-by-backlinks'"
  (let ((node-a (cdr completion-a))
	(node-b (cdr completion-b)))
    (>= (org-roam-node-backlinkscount-number node-a)
	(org-roam-node-backlinkscount-number node-b))))

(defun org-roam-backlinks-node-find-by-backlinks ()
  "Essentially works like `org-roam-node-find' (although it uses
a combination of `find-file' and `org-roam-node-read' to
accomplish that and not `org-roam-node-find' as only
`org-roam-node-read' can take a sorting function as an argument)
but the list of nodes is sorted by the number of backlinks
instead of most recent nodes. Sorting is done with
`org-roam-backlinks-sort-by-backlinks'"
  (interactive)
  (find-file (org-roam-node-file (org-roam-node-read nil nil #'org-roam-backlinks-sort-by-backlinks))))

(defun org-roam-backlinks-query ()
  "Simple org-roam query function that stores the IDs of all the
  files that link to the node at point. This is a modified part
  of the `org-roam-backlinks-get' function keeping only the part
  necessary for `org-roam-backlinks-find-files' to work as this is a
  complimentary function to that"
  (org-roam-db-query
   [:select [source dest]
	    :from links
	    :where (= dest $s1)
	    :and (= type "id")]
   (org-roam-node-id (org-roam-node-at-point))))

(defun org-roam-backlinks-find-files ()
    "Get all nodes that link to the node at point with the
    `org-roam-backlink-query' function, find their absolute path
    and save a list of those paths to the buffer local variable
    `org-roam-backlinks'.

  With the list, you can act on all those files together. This is
  exceptionally useful with index files as it allows you to do an
  action on all files linked to this index automatically."
    (interactive)
    (let ((backlinks (length (org-roam-backlinks-query))))
      (dotimes (number backlinks)
	(let* ((id (car (nth number (org-roam-backlinks-query))))
	       (node (org-roam-node-from-id id)))
	  (setq-local org-roam-backlinks-files (cons (org-roam-node-file node) org-roam-backlinks-files))))
      org-roam-backlinks-files))

(defun org-roam-backlinks-export-to-latex-pdf ()
  "Export the current buffer and every buffer that mentions it to
a pdf through the org-latex export. Makes use of the
`org-roam-backlinks-find-files' function to find all the
backlinks. Also saves all the pdf names in a variable called
`org-roam-backlinks-pdfs'. These names can then be passed to
something like pdftk to merge them into one pdf"
  (interactive)
  (save-current-buffer
    (let ((backlinks (cons (buffer-file-name) org-roam-backlinks-files))
	  (org-startup-with-latex-preview nil))
      (while backlinks
	(find-file (car backlinks))
	(org-latex-export-to-pdf)
	(setq org-roam-backlinks-pdfs
	      (cons (concat (file-name-sans-extension (car backlinks)) ".pdf") org-roam-backlinks-pdfs))
	(setq backlinks (cdr backlinks)))))
  (message "%s" "Done!"))
