emacs/.emacs.d/libs/zettelkasten.el

(defcustom org-roam-backlinks-choices '("View Backlinks" "Go to Node" "Add to Zetteldesk" "Find Similar Nodes" "Quit")
  "List of choices for `org-roam-backlinks-node-read'.
Check that function's docstring for more info about these.")

(defun org-roam-backlinks-query* (NODE)
  "Gets the backlinks of NODE with `org-roam-db-query'."
  (org-roam-db-query
	[:select [source dest]
		 :from links
		 :where (= dest $s1)
		 :and (= type "id")]
	(org-roam-node-id NODE)))

(defun org-roam-backlinks-p (SOURCE NODE)
  "Predicate function that checks if NODE is a backlink of SOURCE."
  (let* ((source-id (org-roam-node-id SOURCE))
	 (backlinks (org-roam-backlinks-query* SOURCE))
	 (id (org-roam-node-id NODE))
	 (id-list (list id source-id)))
    (member id-list backlinks)))

(defun org-roam-backlinks-poi-or-moc-p (NODE)
  "Check if NODE has the tag POI or the tag MOC.  Return t if it does."
  (or (string-equal (car (org-roam-node-tags NODE)) "POI")
      (string-equal (car (org-roam-node-tags NODE)) "MOC")))

(defun org-roam-backlinks--read-node-backlinks (source)
  "Runs `org-roam-node-read' on the backlinks of SOURCE.
The predicate used as `org-roam-node-read''s filter-fn is
`org-roam-backlinks-p'."
  (org-roam-node-read nil (apply-partially #'org-roam-backlinks-p source)))

(defun org-roam-backlinks-node-read (node)
  "Read a NODE and run `org-roam-backlinks--read-node-backlinks'.
Upon selecting a backlink, prompt the user for what to do with
the backlink. The prompt is created with `completing-read' with
valid options being everything in the list
`org-roam-backlinks-choices'.

If the user decides to view the selected node's backlinks, the
function recursively runs itself with the selection as its
argument. If they decide they want to go to the selected node,
the function runs `find-file' and the file associated to that
node. Lastly, if they choose to quit, the function exits
silently.

There is however also the option to add the node to the current
`zetteldesk-desktop'. `zetteldesk.el' is a package I have written
to extend org-roam and naturally I wanted to include some
interaction with it in this function."
  (let* ((backlink (org-roam-backlinks--read-node-backlinks node))
	 (choice (completing-read "What to do with NODE: "
				  org-roam-backlinks-choices)))
    (cond
     ((string-equal
       choice
       (first org-roam-backlinks-choices))
      (org-roam-backlinks-node-read backlink))
     ((string-equal
       choice
       (second org-roam-backlinks-choices))
      (find-file (org-roam-node-file backlink)))
     ((string-equal
       choice
       (third org-roam-backlinks-choices))
      (zetteldesk-add-node-to-desktop backlink))
     ((string-equal
       choice
       (fourth org-roam-backlinks-choices))
      (org-roam-similarity-node-find backlink))
     ((string-equal
       choice
       (fifth org-roam-backlinks-choices))))))

(defun org-roam-backlinks-search ()
  "Select an `org-roam-node' and recursively search its backlinks.

This function is a starter function for
`org-roam-backlinks-node-read' which gets the initial node
selection from `org-roam-node-list'. For more information about
this function, check `org-roam-backlinks-node-read'."
  (interactive)
  (let ((node (org-roam-node-read)))
    (org-roam-backlinks-node-read node)))

(defun org-roam-backlinks-search-from-moc-or-poi ()
  "`org-roam-backlinks-search' with an initial selection filter.

Since nodes tagged as \"MOC\" or \"POI\" are the entry points to
my personal zettelkasten, I have this helper function which is
identical to `org-roam-backlinks-search' but filters initial
selection to only those notes. That way, they initial selection
has a point as it will be on a node that has a decent amount of
backlinks."
  (interactive)
  (let ((node (org-roam-node-read nil #'org-roam-backlinks-poi-or-moc-p)))
    (org-roam-backlinks-node-read node)))

(defvar org-roam-backlinks-selected-nodes '()
  "List of nodes selected in `org-roam-backlinks--select-nodes'.")

(defun org-roam-backlinks--select-nodes (NUM)
  "Select NUM `org-org-roam-nodes' and return a list of those."
  (setq org-roam-backlinks-selected-nodes '())
  (dotimes (i NUM)
    (let ((node (org-roam-node-read)))
      (add-to-list 'org-roam-backlinks-selected-nodes node)))
  org-roam-backlinks-selected-nodes)

(defvar org-roam-backlinks-selected-node-backlinks '()
  "List of backlinks of nodes in `org-roam-backlinks-selected-nodes'.

This list is filled using `org-roam-backlinks-get-node-backlinks'")

(defun org-roam-backlinks-get-node-backlinks (NUM)
  "Get a list of lists of backlinks of the nodes in NODE-LIST."
  (setq org-roam-backlinks-selected-node-backlinks '())
  (let ((node-list (org-roam-backlinks--select-nodes NUM)))
    (dolist (node node-list)
      (let ((backlinks (org-roam-backlinks-query* node))
	    (backlink-ids))
	(dolist (id backlinks)
	  (add-to-list 'backlink-ids (car id)))
	(add-to-list 'org-roam-backlinks-selected-node-backlinks backlink-ids)))
    org-roam-backlinks-selected-node-backlinks))

(defun org-roam-backlinks-id-intersection (list1 list2)
  "Find intersection of LIST1 and LIST2 using `cl-loop'."
  (cl-loop for id in list1
	   if (member id list2)
	   collect id into ids
	   finally (return ids)))

(defun org-roam-backlinks-get-ids (NUM)
  "Get the ids of all nodes which are backlinks of the selected nodes.

Node selection is done with the underlying function
`org-roam-backlinks--select-nodes'."
  (let* ((backlink-ids (org-roam-backlinks-get-node-backlinks NUM))
	 (result (car backlink-ids)))
    (dolist (ids backlink-ids)
      (setq result (org-roam-backlinks-id-intersection result ids)))
    result))
