emacs/.emacs.d/libs/zettelkasten.org
*** Modifying org-roam-node-read to accept a list of nodes
Since we have collected a list of nodes (in the form of their ids) that can not be reproduced with a simple predicate, we need to make a version of ~org-roam-node-read~ which can take this list as an argument. Luckily for me, I have already encountered this problem before in zetteldesk so I have the code ready. Changing them to start with org-roam-backlinks instead of zetteldesk-ref, we get these.

#+BEGIN_SRC elisp :tangle yes

  (defun org-roam-backlinks-roam-node-read--completions* (node-list &optional filter-fn sort-fn)
    "Run `org-roam-node-read--completions' with NODE-LIST being a list of nodes.

  Typically, the function takes `org-roam-node-list' as the initial
  list of nodes and creates the alist `org-roam-node-read'
  uses.  However, it can be helpful to supply the list of nodes
  yourself, when the predicate function used cannot be inferred
  through a filter function of the form this function
  takes.  FILTER-FN and SORT-FN are the same as in
  `org-roam-node-read--completions'.  The resulting alist is to be
  used with `org-roam-backlinks-roam-node-read*'."
    (let* ((template (org-roam-node--process-display-format org-roam-node-display-template))
	   (nodes node-list)
	   (nodes (mapcar (lambda (node)
			    (org-roam-node-read--to-candidate node template)) nodes))
	   (nodes (if filter-fn
		      (cl-remove-if-not
		       (lambda (n) (funcall filter-fn (cdr n)))
		       nodes)
		    nodes))
	   (sort-fn (or sort-fn
			(when org-roam-node-default-sort
			  (intern (concat "org-roam-node-read-sort-by-"
					  (symbol-name org-roam-node-default-sort))))))
	   (nodes (if sort-fn (seq-sort sort-fn nodes)
		    nodes)))
      nodes))

  (defun org-roam-backlinks-roam-node-read* (node-list &optional initial-input filter-fn sort-fn require-match prompt)
    "Run `org-roam-node-read' with the nodes supplied by NODE-LIST.

  NODE-LIST is a list of nodes passed to
  `org-roam-backlinks-roam-node-read--completions*', which creates an alist of
  nodes with the proper formatting to be used in this
  function.  This is for those cases where it is helpful to use your
  own list of nodes, because a predicate function can not filter
  them in the way you want easily.

  INITIAL-INPUT, SORT-FN, FILTER-FN, REQUIRE-MATCH, PROMPT are the
  same as in `org-roam-node-read'."
    (let* ((nodes (org-roam-backlinks-roam-node-read--completions* node-list filter-fn sort-fn))
	   (prompt (or prompt "Node: "))
	   (node (completing-read
		  prompt
		  (lambda (string pred action)
		    (if (eq action 'metadata)
			`(metadata
			  ;; Preserve sorting in the completion UI if a sort-fn is used
			  ,@(when sort-fn
			      '((display-sort-function . identity)
				(cycle-sort-function . identity)))
			  (annotation-function
			   . ,(lambda (title)
				(funcall org-roam-node-annotation-function
					 (get-text-property 0 'node title))))
			  (category . org-roam-node))
		      (complete-with-action action nodes string pred)))
		  nil require-match initial-input 'org-roam-node-history)))
      (or (cdr (assoc node nodes))
	  (org-roam-node-create :title node))))

#+END_SRC

*** Interactive functions and user interface
Finally, we are down to the easiest part. Having written the backbone of the process, we need to allow the user to select a single node from the possible choices in an interactive way and then write the end user functions which take this node and do things with it. For now, I will implement an ~org-roam-node-find~ style function and a connection to the above section to kickstart ~org-roam-backlinks-node-read~ with this instead of what ~org-roam-backlinks-search~ does. These functions are shown below

#+BEGIN_SRC elisp :tangle yes

  (defun org-roam-backlinks-multi-node-read ()
    "Read a node from intersecting backlinks of multiple nodes.

  This is the low-level interactive function which is used for
  collecting the nodes which are backlinks to a number of selected
  nodes. This function calls `org-roam-backlinks-get-ids' for a lot
  of the work, which returns a list of ids of all nodes which are
  backlinked to some selected nodes. For more, check its
  docstring. With this list of ids, this function runs
  `org-roam-backlinks-roam-node-read*', which is a modified
  `org-roam-node-read' which accepts a list of nodes as its
  argument. This function returns the selected node to be used in
  the higher level functions."
    (interactive)
    (let* ((num (read-number "Number of Nodes: "))
	   (ids (org-roam-backlinks-get-ids num))
	   (nodes (cl-loop for id in ids
			   collect (org-roam-node-from-id id) into nodes
			   finally (return nodes))))
      (org-roam-backlinks-roam-node-read* nodes)))

  (defun org-roam-backlinks-multi-node-find ()
    "Find node from intersecting backlinks of multiple nodes.

  This is a wrapper function for
  `org-roam-backlinks-multi-node-read', which finds the file
  associated with the selected node instead of returning it."
    (interactive)
    (let ((node (org-roam-backlinks-multi-node-read)))
      (find-file (org-roam-node-file node))))

  (defun org-roam-backlinks-multi-search ()
    "Select an `org-roam-node' and recursively search its backlinks.

  This function is an extension of the `org-roam-backlinks-search'
  function which is used for recursively searching a node's
  backlinks using `org-roam-backlinks-node-read'. Its main
  difference is that it kickstarts the system not by selecting a
  node but by running `org-roam-backlinks-multi-node-read'.  This
  means that the selected node will be the intersection of
  backlinks of a number of nodes selected from that function."
    (interactive)
    (let ((node (org-roam-backlinks-multi-node-read)))
      (org-roam-backlinks-node-read node)))

#+END_SRC

* Logseq-like tagging functionality
  I recently had a [[https://www.reddit.com/r/orgmode/comments/tgb7f9/orgroam_journey/i17ohct/?context=3][discussion]] with a fellow redditor on r/orgmode about how to get some useful features logseq has in org-roam. Especially, he told me how logseq handles tags and some useful features they have. Intrigued by the idea, I decided I could try and implement it to org-roam as a fun little project. It didn't sound so hard so I was like, sure why not. Here's the result I got. I don't even know if I am going to use this, but it can stay here for now. Note that it relies on org-transclusion to do a lot of the work. 

  #+BEGIN_SRC elisp :tangle zettelkasten.el

    (defun org-roam-node-sort-by-atime (NODE1 NODE2)
      "Sorting function that sorts NODE1 and NODE2 by their file atime.

    This is a simplified version of
    `org-roam-node-read-sort-by-file-atime' which requires nodes as
    its input and not something else. The above function is what
    `org-roam-node-read's sorting uses and it has a special
    formatting."
      (time-less-p (org-roam-node-file-atime NODE1)
		   (org-roam-node-file-atime NODE2)))

    (defun org-roam-logseq-tag-function (TAG)
      "An implementation of logseq's tagging system in org-roam.

    Prompt for TAG which is the name of a tag in your org-roam
    repository, filter it to only contain nodes with that tag and
    sort them so the most recently accessed one is the first item of
    the list. Sorting is done with the custom
    `org-roam-node-sort-by-atime' function. Then, check if a buffer
    exists with the name *TAG-nodes* and if it doesn't create it.

    In that new buffer, switch to org-mode and for every item in the
    sorted-nodes list, go to `point-max', insert a new line, insert
    the string #+transclude: make an org-mode id link with the node's
    id and insert another newline. Once done, run
    `org-transclusion-add-all' to activate the transclusion links and
    view editable versions of the selected nodes.

    Finally, restore the buffer from which this function was called
    and insert and org-mode elisp link that runs `switch-to-buffer'
    to switch to the newly-created buffer."
      (interactive "MTag: ")
      (let* ((init-list (org-roam-node-list))
	     (tagged-nodes (cl-remove-if-not (lambda (NODE)
					       (member TAG (org-roam-node-tags NODE)))
					     init-list))
	     (sorted-nodes (reverse (sort tagged-nodes #'org-roam-node-sort-by-atime)))
	     (buffer-name (concat "*" TAG "-nodes*"))
	     (buffer (get-buffer-create buffer-name)))
	(save-excursion
	  (with-current-buffer buffer
	    (org-mode)
	    (dolist (node sorted-nodes)
	      (goto-char (point-max))
	      (newline)
	      (insert
	       "#+transclude: "
	       (org-link-make-string
		(concat "id:" (org-roam-node-id node))))
	       (newline))
	    (org-transclusion-add-all)))
	(insert
	 (org-link-make-string
	  (concat "elisp:(switch-to-buffer \"" buffer-name "\")")
	  (concat "#" TAG)))))

  #+END_SRC

