emacs/.emacs.d/libs/zettelkasten.el

(setq org-roam-capture-templates
      '(("d" "default" plain "%?" :if-new
	 (file+head "${slug}-%<%d-%m-%y>.org" "#+title: ${title}
- index ::  
- tags :: ")
	 :unnarrowed t
	 :jump-to-captured t)

	("o" "outline" plain "%?" :if-new
	 (file+head "outlines/${slug}-%<%d-%m-%y>.org" "#+title: ${title}
#+filetags: outline")
	 :unnarrowed t
	 :jump-to-captured t)

	("r" "bibliography reference" plain
	 "%?"
	 :if-new
	 (file+head "ref/${citekey}.org" "#+title: ${title}\n
#+filetags: ${entry-type}
- keywords :: ${keywords}
- tags :: 

* Analysis of ${entry-type} by ${author}
:PROPERTIES:
:URL: ${url}
:NOTER_DOCUMENT: ${file}  
:NOTER_PAGE:              
:END:")
	 :unnarrowed t
	 :jump-to-captured t)

	("i" "info reference" plain
	 "%?"
	 :if-new
	 (file+head "ref/${slug}.org" "#+title: ${title}\n
#+filetags: %:type
- tags :: \n

[[elisp:(Info-goto-node \"(%:file)%:node\")][Link to Info page]]
     \n
     ")
	 :unnarowed t)

	("e" "elfeed" plain
	 "%?"
	 :if-new
	 (file+head "ref/${slug}.org" "#+title: %:description\n
#+filetags: %:type
- keywords ::
- tags :: \n\n\n

[[%:link][Link to Elfeed Buffer]]
[[%:elfeed-entry-link][Link to Web Page]]")
	 :unnarowed t)

	("t" "thesis" plain "%?" :if-new
	 (file+head "thesis/${slug}-%<%d-%m-%y>.org" "#+title: ${title}
- index ::  
- tags :: ")
	 :unnarrowed t
	 :jump-to-captured t)))

(setq org-roam-capture-ref-templates 
      '(("r" "ref" entry "* %?" :target
	 (file+head "ref/${slug}.org" "#+title: ${title}\n
     #+filetags: 
      - tags :: \n")
	 :unnarrowed t
	 :jump-to-captured t)))

(setq org-roam-dailies-capture-templates
      '(("d" "default" entry "* %?" :if-new
	 (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n#+filetags: daily")
	 :empty-lines 1)))

(provide 'zettelkasten)
